#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

google_compute_global_address.default: Refreshing state... [id=projects/cloudops-388321/global/addresses/resume]
google_compute_network.vpc: Refreshing state... [id=projects/cloudops-388321/global/networks/cloudops-388321-vpc]
google_storage_bucket.default: Refreshing state... [id=davidbour-cloud-resume-db]
google_service_account.service_account: Refreshing state... [id=projects/cloudops-388321/serviceAccounts/cloud-run-invoker@cloudops-388321.iam.gserviceaccount.com]
google_compute_managed_ssl_certificate.default: Refreshing state... [id=projects/cloudops-388321/global/sslCertificates/cloud-resume-cert-managed]
google_firebase_project.default: Refreshing state... [id=projects/cloudops-388321]
google_project_service.firebase_database: Refreshing state... [id=cloudops-388321/firebasedatabase.googleapis.com]
google_project_iam_member.cloudrun-invoker: Refreshing state... [id=cloudops-388321/roles/run.invoker/serviceAccount:cloud-run-invoker@cloudops-388321.iam.gserviceaccount.com]
google_storage_bucket_iam_member.default: Refreshing state... [id=b/davidbour-cloud-resume-db/roles/storage.objectViewer/allUsers]
google_compute_backend_bucket.default: Refreshing state... [id=projects/cloudops-388321/global/backendBuckets/cloud-resume-db-backend-bucket]
google_compute_subnetwork.subnet: Refreshing state... [id=projects/cloudops-388321/regions/us-central1/subnetworks/cloudops-388321-subnet]
google_compute_url_map.default: Refreshing state... [id=projects/cloudops-388321/global/urlMaps/http-lb]
google_container_cluster.primary: Refreshing state... [id=projects/cloudops-388321/locations/us-central1/clusters/cloudops-388321-gke]
google_compute_target_https_proxy.default: Refreshing state... [id=projects/cloudops-388321/global/targetHttpsProxies/cloud-https-proxy]
google_compute_global_forwarding_rule.default: Refreshing state... [id=projects/cloudops-388321/global/forwardingRules/https-lb-forwarding-rule]
google_container_node_pool.primary_nodes: Refreshing state... [id=projects/cloudops-388321/locations/us-central1/clusters/cloudops-388321-gke/nodePools/cloudops-388321-gke]
google_firebase_database_instance.default: Refreshing state... [id=projects/cloudops-388321/locations/us-central1/instances/cloudops-388321-default-rtdb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_url_map.default will be updated in-place
  ~ resource "google_compute_url_map" "default" {
        id                 = "projects/cloudops-388321/global/urlMaps/http-lb"
        name               = "http-lb"
        # (6 unchanged attributes hidden)

      - host_rule {
          - hosts        = [
              - "api.davidbour.com",
            ] -> null
          - path_matcher = "path-matcher-1" -> null
        }

      - path_matcher {
          - default_service = "https://www.googleapis.com/compute/v1/projects/cloudops-388321/global/backendServices/api" -> null
          - name            = "path-matcher-1" -> null
        }
    }

  # google_container_cluster.primary must be replaced
-/+ resource "google_container_cluster" "primary" {
      ~ cluster_ipv4_cidr           = "10.224.0.0/14" -> (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      - enable_autopilot            = false -> null
      ~ enable_intranode_visibility = false -> (known after apply)
      - enable_tpu                  = false -> null
      ~ endpoint                    = "34.133.47.206" -> (known after apply)
      ~ id                          = "projects/cloudops-388321/locations/us-central1/clusters/cloudops-388321-gke" -> (known after apply)
      ~ label_fingerprint           = "a9dc16a7" -> (known after apply)
      ~ location                    = "us-central1" -> "us-central1-f" # forces replacement
      ~ logging_service             = "logging.googleapis.com/kubernetes" -> (known after apply)
      ~ master_version              = "1.26.5-gke.1200" -> (known after apply)
      ~ monitoring_service          = "monitoring.googleapis.com/kubernetes" -> (known after apply)
        name                        = "cloudops-388321-gke"
      ~ network                     = "projects/cloudops-388321/global/networks/cloudops-388321-vpc" -> "cloudops-388321-vpc"
      ~ networking_mode             = "ROUTES" -> (known after apply)
      ~ node_locations              = [
          - "us-central1-a",
          - "us-central1-b",
          - "us-central1-f",
        ] -> (known after apply)
      ~ node_version                = "1.26.5-gke.1200" -> (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      ~ project                     = "cloudops-388321" -> (known after apply)
      - resource_labels             = {} -> null
      ~ self_link                   = "https://container.googleapis.com/v1/projects/cloudops-388321/locations/us-central1/clusters/cloudops-388321-gke" -> (known after apply)
      ~ services_ipv4_cidr          = "10.227.240.0/20" -> (known after apply)
      ~ subnetwork                  = "projects/cloudops-388321/regions/us-central1/subnetworks/cloudops-388321-subnet" -> "cloudops-388321-subnet"
      + tpu_ipv4_cidr_block         = (known after apply)
        # (7 unchanged attributes hidden)

      - addons_config {
          - gce_persistent_disk_csi_driver_config {
              - enabled = true -> null
            }
          - network_policy_config {
              - disabled = true -> null
            }
        }

      - binary_authorization {
          - enabled = false -> null
        }

      - cluster_autoscaling {
          - enabled = false -> null
        }

      - database_encryption {
          - state = "DECRYPTED" -> null
        }

      - default_snat_status {
          - disabled = false -> null
        }

      - logging_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
              - "WORKLOADS",
            ] -> null
        }

      - master_auth {
          - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMVENDQXBXZ0F3SUJBZ0lSQUtScExaQVk5bW9GMFZRNzNCN1h4Q0F3RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa09USTBaVGd4TVRjdE9UUTNZeTAwTjJKbUxUZzJZV0V0T0RnMk9XUmhaRGMyTURsagpNQ0FYRFRJek1EY3hNekF5TXpreE5sb1lEekl3TlRNd056QTFNRE16T1RFMldqQXZNUzB3S3dZRFZRUURFeVE1Ck1qUmxPREV4TnkwNU5EZGpMVFEzWW1ZdE9EWmhZUzA0T0RZNVpHRmtOell3T1dNd2dnR2lNQTBHQ1NxR1NJYjMKRFFFQkFRVUFBNElCandBd2dnR0tBb0lCZ1FEYVplK1cxdFlkNHpQazRhbGs0UHVCT0hmNFpWWjB2clBqV1Roawp3NXFRVURpcFJsOFpZS2pmMVFpTjNzOVFrQzgwbEtKcjZiSGJIUjJMclViV1JwdDVqeSt4OVI1NnlTZS9yaERICldpdVRWVzdhbHltUENuMTQ0VmN3dldsMjRHWjJjTFhqejJBL3R4V1ZuOFRBendjOEc3WWNOYUdGRkNEb3AzYTIKQks2WnFCald3cGgvakExazhReHUyMnNyVDA4UGxWdFFFTGlRVmZwUDQrZUQrMEVwamxwVHNQSFFCQkJUQ21IdQpTbDV0cnJZbzVGWkhUTnd3VGlBbWEyam5hcFN2MzZtUHIraGtScDQrV1p6SDZBVzN4cWpvMnFVSk5hWHZMK3hJCjQya0ZWbUZySExXSFdzamZZdmlIOVhhUVN0aGZXT3FBL2tzOXA3c3JBYTdoYmpMRCtlNkZib3VWemh1NVBSWTEKeFhsS0Y5TW9xOUUyUWRRalVvTFdnd2xvNHBYNGpIZUUyYzNITGNDTVpsT2x2ODFNVno0Z21td2YzdGxXRWpOWgpBZGpnbWo0L29maTJNdzA0UHE5dGxDTkJLa0hLVjZ6bVI4R21ndHhWeFNIVGlXSXEvTENJV1JlU0QzazZQcTlBCklQNkVyeHFZWXllcUpBT29Tb3cxdGdSMG9KY0NBd0VBQWFOQ01FQXdEZ1lEVlIwUEFRSC9CQVFEQWdJRU1BOEcKQTFVZEV3RUIvd1FGTUFNQkFmOHdIUVlEVlIwT0JCWUVGSkppL1VZcDBIQnRqVU40TTF6SnpLd0hlMkZaTUEwRwpDU3FHU0liM0RRRUJDd1VBQTRJQmdRQlFOUHJuSEIwMDY0WUFrNU5Qc1JZNUJReHNqNXhZWFpvL3plcnhPaGRrCktlQ1BadXRtVlplYTlsWkVRZDY0VjdsZDI1WWVZTVpLZTFXWUdFK2NpNHdyb2R4RmsyYXg2STZrQjdVZUR4QjEKaVl5NG1ZVllwU244Z2FneTc2R0phaWdDWS9qUjlOLzU0OVlSVnBhTksvbnd0emtlTFJ4N1Zic1A4WlhTcjhJdApVMkk4ODZ6SGNUdGhMelZvVHpqN01CUUc3MjRQTzBHMVFwL2Z3OStXVW5Kc0pFanEyM1lDVDNHcnZSQWlRSU1ICmNHcTBXeDRLZWRheVZrVTc0MStZcmFzVXlRQ2lVZFlMVWVEaXcyQWtJOTMyMVFpc0VNTWdRYUJka0haTkh0SU8KRkRlUUdpU0RVRWJucUtaTkZBS3Rtc0lHUUtkcThJNC85VEF6eFk5OG5qMVg1Z2hNaG5KM25hZHArZWhwVTR1NQpwdHVieGNPQU5aSmdrSEFXSmw1elI3M1JkQ2JHY2hJVHZjRjYvOUt5eitaVWdreUpiZ05FWDlxRkc0UGZZVEMvCjh1L0w5T3pqcGFGUXNFUHpyR3p3LzY0dFBlcjUzYlIwNzQ2ZDZBNS8vckVFQ2xacjd6SU1yUnFwUTNMMjg0bFEKbE9nZm1TWGI3OVRlRUM1QTBGVDhNTzQ9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> null

          - client_certificate_config {
              - issue_client_certificate = false -> null
            }
        }

      - monitoring_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
            ] -> null
        }

      - network_policy {
          - enabled  = false -> null
          - provider = "PROVIDER_UNSPECIFIED" -> null
        }

      + node_config { # forces replacement
          + disk_size_gb      = 40 # forces replacement
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = false # forces replacement
          + service_account   = (known after apply)
          + spot              = false # forces replacement
          + taint             = (known after apply)
        }

      - node_pool_defaults {
          - node_config_defaults {
              - logging_variant = "DEFAULT" -> null
            }
        }

      - notification_config {
          - pubsub {
              - enabled = false -> null
            }
        }

      - private_cluster_config {
          - enable_private_endpoint = false -> null
          - enable_private_nodes    = false -> null
          - private_endpoint        = "10.10.0.6" -> null
          - public_endpoint         = "34.133.47.206" -> null

          - master_global_access_config {
              - enabled = false -> null
            }
        }

      - release_channel {
          - channel = "REGULAR" -> null
        }

      - service_external_ips_config {
          - enabled = false -> null
        }
    }

  # google_container_node_pool.primary_nodes will be created
  + resource "google_container_node_pool" "primary_nodes" {
      + cluster                     = "cloudops-388321-gke"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-central1-f"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "cloudops-388321-gke"
      + name_prefix                 = (known after apply)
      + node_count                  = 1
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + version                     = (known after apply)

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = {
              + "env" = "cloudops-388321"
            }
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "n1-standard-1"
          + metadata          = {
              + "disable-legacy-endpoints" = "true"
            }
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = false
          + tags              = [
              + "gke-node",
              + "cloudops-388321-gke",
            ]
          + taint             = (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @david-bour, Action: `pull_request`*